###################################################################

# Created by write_sdc on Fri Dec 29 18:56:28 2023

###################################################################
set sdc_version 1.5

set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_load -pin_load 0.001913 [get_ports {PO_im_addr[15]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[14]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[13]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[12]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[11]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[10]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[9]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[8]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[7]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[6]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[5]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[4]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[3]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[2]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[1]}]
set_load -pin_load 0.001913 [get_ports {PO_im_addr[0]}]
set_load -pin_load 0.001913 [get_ports {PO_im_w_en[3]}]
set_load -pin_load 0.001913 [get_ports {PO_im_w_en[2]}]
set_load -pin_load 0.001913 [get_ports {PO_im_w_en[1]}]
set_load -pin_load 0.001913 [get_ports {PO_im_w_en[0]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[31]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[30]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[29]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[28]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[27]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[26]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[25]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[24]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[23]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[22]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[21]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[20]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[19]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[18]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[17]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[16]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[15]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[14]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[13]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[12]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[11]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[10]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[9]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[8]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[7]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[6]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[5]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[4]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[3]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[2]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[1]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_write_data[0]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[15]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[14]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[13]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[12]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[11]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[10]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[9]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[8]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[7]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[6]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[5]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[4]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[3]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[2]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[1]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_addr[0]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_w_en[3]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_w_en[2]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_w_en[1]}]
set_load -pin_load 0.001913 [get_ports {PO_dm_w_en[0]}]
set_load -pin_load 0.001913 [get_ports PO_halt]
set_load -pin_load 0.001913 [get_ports PO_print_flag]
create_clock [get_ports PI_clk]  -period 30  -waveform {15 30}
set_clock_latency 2  [get_clocks clk]
create_clock [get_ports PI_nclk]  -period 30  -waveform {15 30}
set_clock_latency 2  [get_clocks nclk]
set_input_delay -clock nclk  -max 1  [get_ports PI_clk]
set_input_delay -clock nclk  -min 0.2  [get_ports PI_clk]
set_input_delay -clock clk  -max 1  [get_ports PI_nclk]
set_input_delay -clock clk  -min 0.2  [get_ports PI_nclk]
set_input_delay -clock nclk  -max 1  [get_ports PI_rst]
set_input_delay -clock nclk  -min 0.2  [get_ports PI_rst]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[31]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[31]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[30]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[30]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[29]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[29]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[28]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[28]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[27]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[27]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[26]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[26]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[25]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[25]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[24]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[24]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[23]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[23]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[22]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[22]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[21]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[21]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[20]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[20]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[19]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[19]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[18]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[18]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[17]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[17]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[16]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[16]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[15]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[15]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[14]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[14]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[13]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[13]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[12]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[12]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[11]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[11]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[10]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[10]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[9]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[9]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[8]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[8]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[7]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[7]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[6]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[6]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[5]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[5]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[4]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[4]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[3]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[3]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[2]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[2]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[1]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[1]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_inst[0]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_inst[0]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[31]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[31]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[30]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[30]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[29]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[29]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[28]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[28]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[27]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[27]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[26]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[26]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[25]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[25]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[24]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[24]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[23]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[23]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[22]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[22]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[21]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[21]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[20]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[20]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[19]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[19]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[18]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[18]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[17]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[17]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[16]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[16]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[15]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[15]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[14]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[14]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[13]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[13]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[12]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[12]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[11]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[11]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[10]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[10]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[9]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[9]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[8]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[8]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[7]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[7]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[6]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[6]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[5]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[5]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[4]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[4]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[3]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[3]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[2]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[2]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[1]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[1]}]
set_input_delay -clock nclk  -max 1  [get_ports {PI_dm_read_data[0]}]
set_input_delay -clock nclk  -min 0.2  [get_ports {PI_dm_read_data[0]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[15]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[15]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[14]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[14]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[13]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[13]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[12]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[12]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[11]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[11]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[10]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[10]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[9]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[9]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[8]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[8]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[7]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[7]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[6]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[6]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[5]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[5]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[4]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[4]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[3]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[3]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[2]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[2]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[1]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[1]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_addr[0]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_addr[0]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_w_en[3]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_w_en[3]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_w_en[2]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_w_en[2]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_w_en[1]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_w_en[1]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_im_w_en[0]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_im_w_en[0]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[31]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[31]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[30]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[30]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[29]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[29]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[28]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[28]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[27]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[27]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[26]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[26]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[25]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[25]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[24]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[24]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[23]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[23]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[22]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[22]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[21]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[21]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[20]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[20]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[19]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[19]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[18]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[18]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[17]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[17]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[16]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[16]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[15]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[15]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[14]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[14]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[13]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[13]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[12]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[12]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[11]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[11]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[10]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[10]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[9]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[9]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[8]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[8]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[7]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[7]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[6]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[6]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[5]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[5]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[4]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[4]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[3]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[3]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[2]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[2]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[1]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[1]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_write_data[0]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_write_data[0]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[15]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[15]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[14]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[14]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[13]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[13]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[12]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[12]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[11]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[11]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[10]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[10]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[9]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[9]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[8]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[8]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[7]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[7]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[6]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[6]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[5]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[5]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[4]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[4]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[3]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[3]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[2]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[2]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[1]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[1]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_addr[0]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_addr[0]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_w_en[3]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_w_en[3]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_w_en[2]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_w_en[2]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_w_en[1]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_w_en[1]}]
set_output_delay -clock nclk  -max 1  [get_ports {PO_dm_w_en[0]}]
set_output_delay -clock nclk  -min 0.1  [get_ports {PO_dm_w_en[0]}]
set_output_delay -clock nclk  -max 1  [get_ports PO_halt]
set_output_delay -clock nclk  -min 0.1  [get_ports PO_halt]
set_output_delay -clock nclk  -max 1  [get_ports PO_print_flag]
set_output_delay -clock nclk  -min 0.1  [get_ports PO_print_flag]
set_drive 6.60925  [get_ports PI_clk]
set_drive 6.60925  [get_ports PI_nclk]
set_drive 6.60925  [get_ports PI_rst]
set_drive 6.60925  [get_ports {PI_inst[31]}]
set_drive 6.60925  [get_ports {PI_inst[30]}]
set_drive 6.60925  [get_ports {PI_inst[29]}]
set_drive 6.60925  [get_ports {PI_inst[28]}]
set_drive 6.60925  [get_ports {PI_inst[27]}]
set_drive 6.60925  [get_ports {PI_inst[26]}]
set_drive 6.60925  [get_ports {PI_inst[25]}]
set_drive 6.60925  [get_ports {PI_inst[24]}]
set_drive 6.60925  [get_ports {PI_inst[23]}]
set_drive 6.60925  [get_ports {PI_inst[22]}]
set_drive 6.60925  [get_ports {PI_inst[21]}]
set_drive 6.60925  [get_ports {PI_inst[20]}]
set_drive 6.60925  [get_ports {PI_inst[19]}]
set_drive 6.60925  [get_ports {PI_inst[18]}]
set_drive 6.60925  [get_ports {PI_inst[17]}]
set_drive 6.60925  [get_ports {PI_inst[16]}]
set_drive 6.60925  [get_ports {PI_inst[15]}]
set_drive 6.60925  [get_ports {PI_inst[14]}]
set_drive 6.60925  [get_ports {PI_inst[13]}]
set_drive 6.60925  [get_ports {PI_inst[12]}]
set_drive 6.60925  [get_ports {PI_inst[11]}]
set_drive 6.60925  [get_ports {PI_inst[10]}]
set_drive 6.60925  [get_ports {PI_inst[9]}]
set_drive 6.60925  [get_ports {PI_inst[8]}]
set_drive 6.60925  [get_ports {PI_inst[7]}]
set_drive 6.60925  [get_ports {PI_inst[6]}]
set_drive 6.60925  [get_ports {PI_inst[5]}]
set_drive 6.60925  [get_ports {PI_inst[4]}]
set_drive 6.60925  [get_ports {PI_inst[3]}]
set_drive 6.60925  [get_ports {PI_inst[2]}]
set_drive 6.60925  [get_ports {PI_inst[1]}]
set_drive 6.60925  [get_ports {PI_inst[0]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[31]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[30]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[29]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[28]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[27]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[26]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[25]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[24]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[23]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[22]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[21]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[20]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[19]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[18]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[17]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[16]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[15]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[14]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[13]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[12]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[11]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[10]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[9]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[8]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[7]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[6]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[5]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[4]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[3]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[2]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[1]}]
set_drive 6.60925  [get_ports {PI_dm_read_data[0]}]
